cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "multipass"
cask "rectangle"
cask "stats"
cask "raycast"
cask "hammerspoon"
cask "google-japanese-ime"
cask "cleanshot"
cask "deepl"
cask "monitorcontrol"
cask "gitify"
brew "telnet"
brew "lolcat"
