tap "b-ramsey/kali"
tap "homebrew/bundle"
tap "homebrew/services"
brew "act"
brew "argocd"
brew "gettext"
brew "aria2"
brew "coreutils"
brew "libtool"
brew "autoconf@2.69", link: true
brew "awscli"
brew "bat"
brew "binwalk"
brew "node"
brew "bitwarden-cli"
brew "cava"
brew "ctags"
brew "direnv"
brew "exiftool"
brew "exploitdb"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffuf"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "gnupg"
brew "gpgme"
brew "grc"
brew "haiti"
brew "hashcat"
brew "helm"
brew "mysql-client"
brew "hydra"
brew "jnv"
brew "john-jumbo"
brew "jpeg"
brew "jq"
brew "k6"
brew "k9s"
brew "kubeseal"
brew "libsixel"
brew "qemu"
brew "lima"
brew "mise"
brew "neovim"
brew "netcat"
brew "nkf"
brew "nmap"
brew "openvpn"
brew "redis"
brew "ripgrep"
brew "samba"
brew "sevenzip"
brew "sheldon"
brew "shellcheck"
brew "starship"
brew "telnet"
brew "tlrc"
brew "tmux"
brew "tor", restart_service: true
brew "vegeta"
brew "vim"
brew "vivid"
brew "watch"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
cask "multipass"
cask "rectangle"
