tap "homebrew/bundle"
tap "homebrew/services"

brew "bat"
brew "coreutils"
brew "ctags"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "gnupg"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "mise"
brew "ncurses"
brew "neovim"
brew "netcat"
brew "nkf"
brew "ripgrep"
brew "sevenzip"
brew "sheldon"
brew "shellcheck"
brew "starship"
brew "telnet"
brew "tmux"
brew "vim"
brew "vivid"
brew "watch"
brew "wget"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-completions"

cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
