antfu.browse-lite
asciidoctor.asciidoctor-vscode
be5invis.toml
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-kubernetes-tools.vscode-kubernetes-tools
ms-vscode-remote.remote-containers
redhat.vscode-yaml
taichi.vscode-textlint
vue.volar
yzhang.markdown-all-in-one
