antfu.browse-lite
be5invis.toml
dbaeumer.vscode-eslint
esbenp.prettier-vscode
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-vscode-remote.remote-containers
vue.volar
yzhang.markdown-all-in-one
